/*************************************************
 * ファイル名	: DataManager.java
 * 作成者		: 村上聖矢
 * 制作日		: 2018/11/12
 * 最終更新者	: なし
 * 最終更新日	: なし
 *
 * 更新履歴
 * 名前			日付		内容
 * 村上聖矢		2018/11/12	新規作成
 *
 ************************************************/
package model.dataManager;

import java.util.ArrayList;
import java.util.HashMap;

/**********************************************************************
 * データベースへの基本操作を行うクラス
**********************************************************************/
public abstract class DataManager {

	/******************************************************************
	 * selectのｓql文を実行する時に使用する
	 * @param i_SQL ,		//実行したいsql文
	 * @param i_Columns 	//取得するカラム名全て
	 * @return 結果を返却する HashMap<カラム名、データ>
	 *****************************************************************/
	protected abstract ArrayList<HashMap<String,String>> select(String i_SQL ,String[] i_Columns );

	/******************************************************************
	 * selectのｓql文を実行する時に使用する
	 * @param i_SQL ,		//実行したいsql文
	 * @return 成功 true , 失敗 false
	 *****************************************************************/
	protected abstract boolean insert(String i_SQL  );

	/******************************************************************
	 * データ接続
	 * @return 成功ならtrue, 失敗ならfalse
	 *****************************************************************/
	protected abstract boolean connect();

	/******************************************************************
	 * データ切断
	 *****************************************************************/
	protected abstract void close();
}
